backend/app/controllers/api/games_controller.rb

SELECT "games".* FROM "games" ORDER BY "games"."sort_order" ASC
---
  def index
    @games = Game.order(sort_order: :asc)